{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": "1.0.0 - 2.0.0"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim",
      "version": "1.0.0 - 2.0.0"
    },
    "gitlinker.nvim": {
      "src": "https://github.com/linrongbin16/gitlinker.nvim",
      "version": "5.0.0 - 6.0.0"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "2.0.0 - 3.0.0"
    },
    "indent-o-matic": {
      "src": "https://github.com/Darazaki/indent-o-matic",
      "version": "'764da1f'"
    },
    "mini.hipatterns": {
      "src": "https://github.com/nvim-mini/mini.hipatterns",
      "version": "0.17.0 - 0.18.0"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "2.0.0 - 3.0.0"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround",
      "version": "4.0.0 - 5.0.0"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/nvim-tree/nvim-tree.lua",
      "version": "1.0.0 - 2.0.0"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'851e865'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons",
      "version": "0.100.0 - 0.101.0"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim",
      "version": "2.0.0 - 3.0.0"
    }
  }
}
